//一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。 
//
// 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。 
//
// 问总共有多少条不同的路径？ 
//
// 
//
// 示例 1： 
//
// 
//输入：m = 3, n = 7
//输出：28 
//
// 示例 2： 
//
// 
//输入：m = 3, n = 2
//输出：3
//解释：
//从左上角开始，总共有 3 条路径可以到达右下角。
//1. 向右 -> 向下 -> 向下
//2. 向下 -> 向下 -> 向右
//3. 向下 -> 向右 -> 向下
// 
//
// 示例 3： 
//
// 
//输入：m = 7, n = 3
//输出：28
// 
//
// 示例 4： 
//
// 
//输入：m = 3, n = 3
//输出：6 
//
// 
//
// 提示： 
//
// 
// 1 <= m, n <= 100 
// 题目数据保证答案小于等于 2 * 109 
// 
// Related Topics 数学 动态规划 组合数学 
// 👍 1059 👎 0


package leetcode.editor.cn

/**
 * 62
 * 不同路径
 *
 * @author Gargantua丶
 * 2021-07-29 02:57:43
 */
class UniquePaths {

    //leetcode submit region begin(Prohibit modification and deletion)
    class Solution {

        fun uniquePaths(m: Int, n: Int): Int {
            val dp = Array(m) { IntArray(n) }
            dp[0][0] = 1
            for (i in 0 until m) {
                for (j in 0 until n) {
                    if(i - 1 >= 0) dp[i][j] += dp[i - 1][j]
                    if(j - 1 >= 0) dp[i][j] += dp[i][j - 1]
                }
            }
            return dp[m - 1][n - 1]
        }
    }
//leetcode submit region end(Prohibit modification and deletion)

}